prst/TMS320F28xxx/5110.c
/* ************************************************************************** */
//#include"f2802x_headers/include/F2802x_Device.h"
#include "include/F2802x_Device.h"     // DSP2802x Headerfile Include File

#include "types.h"
#include "init.h"

#include "5110.h"

#include "./include/DSP28x_Project.h"
#include "./include/F2802x_Examples.h"
#include "./include/F2802x_GlobalPrototypes.h"

/*
#include "./include/cpu.h"
#include "./include/clk.h"
#include "./include/flash.h"
#include "./include/gpio.h"
#include "./include/pll.h"
#include "./include/pwm.h"
#include "./include/wdog.h"
#include "./include/pie.h"
//#include "./include/pie_init.h"
#include "./include/timer.h"
#include "./include/adc.h"
#include "./include/sci.h"
*/

//#include "./F28027_SCI.h"
//#include "TM1638.h"

#include "n5110.h"
#include "5110.h"

#include "interrupts.h"

/* ************************************************************************** */

extern CPU_Handle   myCpu;
extern PLL_Handle   myPll;
extern CLK_Handle   myClk;
extern FLASH_Handle myFlash;
extern ADC_Handle   myAdc;
extern SCI_Handle   mySci;
extern GPIO_Handle  myGpio;
extern PIE_Handle   myPie;
extern PWM_Handle   myPwm1, myPwm2, myPwm3;
extern TIMER_Handle myTimer;
extern WDOG_Handle  myWDog;


/* ************************************************************************** */
// j6   | pin   |
// -----+-------+---------------------------------------------------------------
// RST  | GPIO0 |   сброс
// CE   | GPIO1 |   включение
// DC   | GPIO2 |   Команда / данные
// SDIN | GPIO3 |   Последовательный ввод данных
// SCLK | GPIO4 |   последовательный ввод тактов
/* ************************************************************************** */


/* ************************************************************************** */
/*
 * Имя                   : init_5110
 * Описание              : Производит инициализацию порта и SPI МК, контроллера LCD
 * Аргумент(ы)           : Нет
 * Возвращаемое значение : Нет
 */
/* ************************************************************************** */
void init_5110() {
    rst_l;           // Reset (2) 0 OXFD = 11111101
    DELAY(10);       // задержка 5us
    rst_h;           // Reset (2) 1

    ce_l;            // чип включить (3) 0, открытая 0xFB = 11111011
    DELAY(0);        // задержка 5us
    ce_h;            // чип рядом

    // Отправляем команды дисплею
    // ........................................................................
    // Включаем расширенный набор команд (LCD Extended Commands)
    // создание команд
    write_com(0x21);

    // Установка контрастности (LCD Vop)
    // 0xC8 = 11001000
    write_com(0xc8);

    // Установка температурного коэффициента (Temp coefficent)
    // 0x06 = 00000110
    write_com(0x06);

    // Настройка питания (LCD bias mode 1:48)
    // 0x13 = 00010011
    write_com(0x13);

    // Включаем стандартный набор команд и горизонтальную адресацию
    // (LCD Standard Commands,Horizontal addressing mode)
    // основной набор команд.
    write_com(0x20);

    // Нормальный режим (LCD in normal mode)
    // Обычный режим 0x0c = 00001100
    write_com(0x0c);
    // ........................................................................

    lcd_clear();

    ce_l;            // чип позволит 0xFB = 11111011
}
/* ************************************************************************** */


/* ************************************************************************** */
void write_byte (char DATA) {
    char i,j;

    for(i=0;i<8;i++) {
        j=DATA&0x80;    // извлечение высокой
        if(j>0) sdin_h; // если высокой равен 1, то SDIN (4) является высоким
        else  sdin_l;   // если высокий равно 0, то SDIN (4) низкая 0xEF=11101111
        sclk_l;         // SCLK (5) низкий, 0xDF = 11011111
        //DELAY(3);       // задержка 30 тактов, примерно 35us
        DELAY(1);       // задержка 30 тактов, примерно 35us
        sclk_h;         // SCLK (5) является высоким
        DATA<<=1;       // остались данные
    }
    sclk_l;
    sdin_l;             // сделать SDIN (4), SCLK (5) низкая 0XCF=11001111
}
/* ************************************************************************** */


/* ************************************************************************** */
void write_com(char com) {
    ce_l;              // включить чип (2)=0 команда (3)=0 часов, данные 0 0xC3=11000011
	dc_l;
    //DELAY(2);          // задержка 25us
    DELAY(1);          // задержка 25us
    write_byte(com);   // вызываем функцию записи
    ce_h;              // Закрываем чип (2) = 1;
}
/* ************************************************************************** */


/* ************************************************************************** */
void write_data(char dat) {
    ce_l;              // включить чип (2)=0 данные (3)=1 данные часы 0 0XCB=11001011
	dc_h;
    //DELAY(2);          // задержка 25us
    DELAY(1);          // задержка 25us
    write_byte(dat);   // вызываем функцию записи
    ce_h;              // Закрываем чип (2) = 0;
}
/* ************************************************************************** */


/* ************************************************************************** */
void set_row(char row) {
    write_com(0x80+row); // сконфигурировать каждый адрес столбца
}
/* ************************************************************************** */


/* ************************************************************************** */
void set_col(char col) {
    write_com(0x40+col); // сконфигурировать каждый адрес строки
}
/* ************************************************************************** */


/* ************************************************************************** */
/*
 * Имя                   : lcd_clear
 * Описание              : Очищает дисплей. Далее необходимо выполнить LcdUpdate
 * Аргумент(ы)           : Нет
 * Возвращаемое значение : Нет
 */
/* ************************************************************************** */
void lcd_clear (void) {
    int i,j;

    for (i=0; i<6; i++) {
    set_col(i);            // шестирядный
    set_row(0);            // записываем первый столбец

    for ( j=0; j<84; j++ ) {
        write_data (0x00); // записать первый 83 из первой колонки каждого столбца написать 0
    }
  }
}
/* ************************************************************************** */





#if 0
/* ************************************************************************** */
/*
 * Имя                   :  LcdContrast
 * Описание              :  Устанавливает контрастность дисплея
 * Аргумент(ы)           :  контраст -> значение от 0x00 к 0x7F
 * Возвращаемое значение :  Нет
 */
/* ************************************************************************** */
void LcdContrast ( byte contrast ) {
    LcdSend( 0x21, LCD_CMD );              // Расширенный набор команд
    LcdSend( 0x80 | contrast, LCD_CMD );   // Установка уровня контрастности
    LcdSend( 0x20, LCD_CMD );              // Стандартный набор команд, горизонтальная адресация
}
/* ************************************************************************** */


/* ************************************************************************** */
/*
 * Имя                   :  LcdSend
 * Описание              :  Отправляет данные в контроллер дисплея
 * Аргумент(ы)           :  data -> данные для отправки
 *                          cd   -> команда или данные (смотри enum в n5110.h)
 * Возвращаемое значение :  Нет
 */
/* ************************************************************************** */
void LcdSend ( byte data, LcdCmdData cd ) {
    // Включаем контроллер дисплея (низкий уровень активный)
    LCD_PORT &= ~( _BV( LCD_CE_PIN ) );

    if ( cd == LCD_DATA ) {
        LCD_PORT |= _BV( LCD_DC_PIN );
    } else {
        LCD_PORT &= ~( _BV( LCD_DC_PIN ) );
    }

    // Отправка данных в контроллер дисплея
    SPDR = data;

    // Ждем окончания передачи
    while ( (SPSR & 0x80) != 0x80 );

    // Отключаем контроллер дисплея
    LCD_PORT |= _BV( LCD_CE_PIN );
}
/* ************************************************************************** */

#endif //0
